Digilent/DMMShield_PIC32_Library/DMMLib.X/dmmcmd.c
/* ************************************************************************** */
/** Descriptive File Name

  @Company
    Digilent

  @File Name
    dmmcmd.c

  @Description
        The DMMCMD module groups the functions that implement the DMM command dispatch module.
        The basic functionality is to interpret the UART received content, recognize specific commands 
        and call the appropriate functions from DMM, CALIB, SERIALNO modules.
        The module also provides an initialization function, that initializes the above mentioned modules 
        whose functions are called from within the command interpreter function.
        All the functions from this module are placed in the "Interface functions" section, as they can also be called by User.
 		In order to successfully communicate you must set your terminal to 9600 Baud, 8 data bits, 1 stop bit, no parity, and configure the transmitted content to be followed by CR+LF          

  @Author
    Cristian Fatu 
    cristian.fatu@digilent.ro
  

  @Versioning:
 	 Cristian Fatu - 2018/06/29 - Initial release, DMMShield Library

 */
/* ************************************************************************** */

/* ************************************************************************** */
/* ************************************************************************** */
/* Section: Included Files                                                    */
/* ************************************************************************** */
#include <xc.h>
#include <sys/attribs.h>
#include "dmmcmd.h"
#include "dmm.h"
#include "serialno.h"
#include "uart.h"
#include "calib.h"
#include <stdio.h>
#include <ctype.h>
#include "errors.h"
#include "fact.h"


/* ************************************************************************** */
/* ************************************************************************** */
// Section: Local Functions Prototypes                                        */
/* ************************************************************************** */
/* ************************************************************************** */
char* DMMCMD_CmdGetNextArg();
cmd_key_t DMMCMD_CmdDecode(char  *szCmd);
void DMMCMD_ProcessCmd(cmd_key_t keyCmd);
uint8_t DMMCMD_ProcessRepeatedCmd();
// individual commands functions
uint8_t DMMCMD_CmdConfig(char const *arg0);
uint8_t DMMCMD_CmdMeasureRep();
uint8_t DMMCMD_CmdMeasureStop();
uint8_t DMMCMD_CmdMeasureRaw();
uint8_t DMMCMD_CmdMeasureAvg();
uint8_t DMMCMD_CmdCalibP(char const *arg0);
uint8_t DMMCMD_CmdCalibN(char const *arg0);
uint8_t DMMCMD_CmdCalibZ();
uint8_t DMMCMD_CmdSaveEPROM();
uint8_t DMMCMD_CmdVerifyEPROM();
uint8_t DMMCMD_CmdExportCalib();
uint8_t DMMCMD_CmdImportCalib(char const *arg0, char const *arg1, char const *arg2);
uint8_t DMMCMD_CmdMeasureForCalibP();
uint8_t DMMCMD_CmdMeasureForCalibN();
uint8_t DMMCMD_CmdFinalizeCalibP(char const *arg0);
uint8_t DMMCMD_CmdFinalizeCalibN(char const *arg0);
uint8_t DMMCMD_CmdRestoreFactCalib();
uint8_t DMMCMD_CmdReadSerialNo();
void EnableCaches();
void DisableCaches();
/* ************************************************************************** */
/* ************************************************************************** */
/* Section: Global Data, local to this module                                 */
/* ************************************************************************** */
/* ************************************************************************** */

// flags for repeated value and repeated raw value
uint8_t fRepGetVal = 0;
uint8_t fRepGetRaw = 0;
// variables used in multiple functions// allocate them only once.
char szMsg[200];
char szVal[20];
char szRefVal[20];
double dRefVal, dMeasuredVal, dispersion;
char *pszLastErr;

/********************* Global Constant Definitions ***************************/
const cmd_map_t uartCommands[] = {
	{"DMMConfig",   		CMD_Config},
	{"DMMCalibP",   		CMD_CalibP},
	{"DMMCalibN",   		CMD_CalibN},
	{"DMMCalibZ",   		CMD_CalibZ},
	{"DMMMeasureRep",   	CMD_MeasureRep},
	{"DMMMeasureStop",		CMD_MeasureStop},
	{"DMMMeasureRaw",   	CMD_MeasureRaw},
	{"DMMMeasureAvg",   	CMD_MeasureAvg},
	{"DMMSaveEPROM",   		CMD_SaveEPROM},
	{"DMMVerifyEPROM",  	CMD_VerifyEPROM},
	{"DMMExportCalib",   	CMD_ExportCalib},
	{"DMMImportCalib",		CMD_ImportCalib},
	{"DMMMeasureForCalibP", CMD_MeasureForCalibP},
	{"DMMMeasureForCalibN", CMD_MeasureForCalibN},
	{"DMMFinalizeCalibP",	CMD_FinalizeCalibP},
	{"DMMFinalizeCalibN",   CMD_FinalizeCalibN},
	{"DMMRestoreFactCalibs",CMD_RestoreFactCalibs},
	{"DMMReadSerialNo",   	CMD_ReadSerialNo}
};

const char rgScales[][20] = {"Resistance50M", "Resistance5M", "Resistance500k", "Resistance50k", "Resistance5k", "Resistance500", "Resistance50",
                         "VoltageDC50", "VoltageDC5", "VoltageDC500m", "VoltageDC50m",
                         "VoltageAC30", "VoltageAC5", "VoltageAC500m", "VoltageAC50m",
                         "CurrentDC5", "CurrentAC5",
                         "Continuity", "Diode",
                         "CurrentDC500m", "CurrentDC50m", "CurrentDC5m", "CurrentDC500u",
                         "CurrentAC500m", "CurrentAC50m", "CurrentAC5m", "CurrentAC500u"};
/* ************************************************************************** */
/* ************************************************************************** */
// Section: Interface Functions                                               */
/* ************************************************************************** */
/* ************************************************************************** */
/***	DMMCMD_Init()
**
**	Parameters:
**		none
**
**	Return Value:
**		uint8_t 
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_EPROM_MAGICNO            0xFD    // wrong Magic No. when reading data from EPROM
**          ERRVAL_EPROM_CRC                0xFE    // wrong CRC when reading data from EPROM
**
**	Description:
**		This function initializes the modules involved in the DMMCMD module. 
**      It initializes the DMM, UART, CALIB and SERIALNO modules.
**      The return values are related to errors when calibration is read from user calibration area of EPROM during calibration initialization call.
**      The function returns ERRVAL_SUCCESS for success. 
**      The function returns ERRVAL_EPROM_MAGICNO when a wrong magic number was detected in the data read from EPROM. 
**      The function returns ERRVAL_EPROM_CRC when the checksum is wrong for the data read from EPROM. 
**         
*/
uint8_t DMMCMD_Init()
{
    // initializes the modules used by UART Command interpreter
    uint8_t bErrCode;
    DMM_Init();
    UART_Init(9600);
    bErrCode = CALIB_Init();
    // no need to process error code as this can be the first run of DMMShield (Calibration not present)
    SERIALNO_Init();
    pszLastErr = ERRORS_GetszLastError();    
    return bErrCode;
}


/***	DMMCMD_CheckForCommand()
**
**	Parameters:
**          none
**		    
**
**	Return Value:
**          none
**
**	Description:
**		This function checks on UART if a command was received. 
**      It compares the received command with the commands defined in the commands array. If recognized, the command is processed accordingly.
**      It also performs the repeated commands.
**
*/
void DMMCMD_CheckForCommand()
{
    char uartCmd[cchRxMax];    
    int cchi = UART_GetString(uartCmd, cchRxMax);
    if(cchi > 0)
    {
	    sprintf(szMsg, "Received command: %s\r\n", uartCmd);
	    UART_PutString(szMsg);        
        DMMCMD_ProcessCmd(DMMCMD_CmdDecode(uartCmd));
    }
    DMMCMD_ProcessRepeatedCmd();
}




/* ************************************************************************** */
/* ************************************************************************** */
// Section: Local Functions                                                   */
/* ************************************************************************** */
/* ************************************************************************** */
/*****************************************************************************/
/***	DMMCMD_CmdDecode
**
**	Parameters:
**		char *szCmd       - zero terminated string that contains the command to be searched
**
**	Return Value:
**          cmd_key_t - the command enumeration value for the found command, or INVALID if command was not found.
**
**	Description:
**		This function tries to identify a command among the defined commands.  
**      It compares the received command with the commands defined in the list of defined commands. 
 *      If the command is found, then the command key is returned. Otherwise INVALID
**      If the command is not found, INVALID enumeration value is returned.
**
*/
cmd_key_t DMMCMD_CmdDecode(char *szCmd)
{
	int idxCmd;

