Digilent/DMMShield_PIC32_Library/DMMLib.X/dmmcmd.c
	char* szJustCmd = strtok(szCmd, " "); // the following calls to strtok function will continue from this point.

	pszLastErr[0] = 0;  // empty last error string

	if (szJustCmd)
	{
		// compare string with values from array of defined commands
		for(idxCmd = 0; idxCmd < sizeof(uartCommands)/sizeof(uartCommands[0]); idxCmd++) 
        {
			if(!strcmp(szJustCmd, uartCommands[idxCmd].pchCmd)) 
            {
				return uartCommands[idxCmd].eCmd;
			}
		}
		strcpy(pszLastErr,"Unrecognized command:");
		strcat(pszLastErr, szJustCmd);
	}
	else
	{
		strcpy(pszLastErr,"Empty command");
	}

	return INVALID;
}


/*****************************************************************************/
/***	DMMCMD_CmdGetNextArg
**
**	Parameters:
**		<none>
**
**	Return Value:
**          char *  string containing next command argument
**
**	Description:
**		This function is used to tokenize a command in order to retrieve the next argument, using strtok 
**      function, considering arguments as tokens separated by blank character.  
**      Calling the function repeatedly will cycle through the arguments, returning NULL when
**      the end is reached.
**      It must be called immediately after CmdDecode, once for every argument expected. No calls to 
**      strtok is permitted in the mean time. 
**
*/
char* DMMCMD_CmdGetNextArg()
{
	return strtok(NULL, ",");
}

/***	DMMCMD_CMD_ProcessCmd
**
**	Parameters:
**     cmd_key_t keyCmd           - the enumerator key corresponding to the command
**
**	Return Value:
**		none
**
**	Description:
**		This function calls the processing function corresponding to the provided enumerator key.
**      It properly provides the command arguments.
**
**
*/
void DMMCMD_ProcessCmd(cmd_key_t keyCmd)
{
    switch(keyCmd)
    {
        case CMD_Config:
        	DMMCMD_CmdConfig(DMMCMD_CmdGetNextArg());
            break;
        case CMD_CalibP:
        	DMMCMD_CmdCalibP(DMMCMD_CmdGetNextArg());
            break;
        case CMD_CalibN:
        	DMMCMD_CmdCalibN(DMMCMD_CmdGetNextArg());
            break;
        case CMD_CalibZ:
        	DMMCMD_CmdCalibZ();
            break;
        case CMD_MeasureRep:
        	DMMCMD_CmdMeasureRep();
            break;
        case CMD_MeasureStop:
        	DMMCMD_CmdMeasureStop();
            break;
        case CMD_MeasureRaw:
        	DMMCMD_CmdMeasureRaw();
            break;
        case CMD_MeasureAvg:
        	DMMCMD_CmdMeasureAvg();
            break;
        case CMD_SaveEPROM:
        	DMMCMD_CmdSaveEPROM();
            break;
        case CMD_VerifyEPROM:
        	DMMCMD_CmdVerifyEPROM();
            break;
        case CMD_ExportCalib:
        	DMMCMD_CmdExportCalib();
            break;
        case CMD_ImportCalib:
        	DMMCMD_CmdImportCalib(DMMCMD_CmdGetNextArg(), DMMCMD_CmdGetNextArg(), DMMCMD_CmdGetNextArg());
            break;
        case CMD_MeasureForCalibP:
        	DMMCMD_CmdMeasureForCalibP();
            break;
        case CMD_MeasureForCalibN:
        	DMMCMD_CmdMeasureForCalibN();
            break;
        case CMD_FinalizeCalibP:
        	DMMCMD_CmdFinalizeCalibP(DMMCMD_CmdGetNextArg());
            break;
        case CMD_FinalizeCalibN:
        	DMMCMD_CmdFinalizeCalibN(DMMCMD_CmdGetNextArg());
            break;
        case CMD_RestoreFactCalibs:
        	DMMCMD_CmdRestoreFactCalib();
            break;
        case CMD_ReadSerialNo:
        	DMMCMD_CmdReadSerialNo();
            break;
//        case CMD_NONE:
        default:
        	// do nothing
            break;
    }
//    DelayAprox10Us(100);
    return;
}

/***	DMMCMD_CmdConfig
**
**	Parameters:
**     char const *arg0           - the character string containing the first command argument, to be interpreted as scale index (integer) 
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS            0      // success
**          ERRVAL_DMM_IDXCONFIG     0xFC    // error, wrong scale index
**          ERRVAL_DMM_CFGVERIFY     0xF5    // DMM Configuration verify error
**
**	Description:
**		This function implements the DMMConfig text command of DMMCMD module.
**      It searches the argument among the defined scales in order to detect the scale index, 
**      then it calls DMM_SetScale providing the scale index as parameter.
**      The function sends over UART the success message or the error message.
**      The function returns the error code, which is the error code returned by the DMM_SetScale function.
**      The function is called by DMMCMD_ProcessCmd function.
**      
*/
uint8_t DMMCMD_CmdConfig(char const *arg0)
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	int idxScale;
    for(idxScale = 0; idxScale < sizeof(rgScales)/sizeof(rgScales[0]); idxScale++)
    {
        if(!strcmp(arg0, rgScales[idxScale]))
        {
            bErrCode = DMM_SetScale(idxScale);// send the selected configuration to the DMM
            if(bErrCode == ERRVAL_SUCCESS)
            {
                sprintf(szMsg, "PASS, Selected scale index is: %d\r\n", idxScale);
            }
            else
            {
                bErrCode = ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
            }
            UART_PutString(szMsg);
            return bErrCode;
        }
    }
    sprintf(szMsg, "FAIL, Missing valid configuration: \"%s\"\r\n", arg0);
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdMeasureRep
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS            0      // success
**
**	Description:
**		This function initiates the DMMMeasureRep repeated command session of DMMCMD module. 
**      The function always returns success: ERRVAL_SUCCESS.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdMeasureRep()
{
	fRepGetVal = 1;
	fRepGetRaw = 0;
    strcpy(szMsg, "Measure repeated");
    ERRORS_GetPrefixedMessageString(ERRVAL_SUCCESS, "", szMsg);
    UART_PutString(szMsg);
    return ERRVAL_SUCCESS;
}

/***	DMMCMD_CmdMeasureStop
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS            0      // success
**
**	Description:
**		This function terminates the DMMMeasureRep and DMMMeasureRaw repeated command sessions of DMMCMD module. 
**      The function always returns success: ERRVAL_SUCCESS.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdMeasureStop()
{
	fRepGetVal = 0;
	fRepGetRaw = 0;
    strcpy(szMsg, "Stop repeated");
    ERRORS_GetPrefixedMessageString(ERRVAL_SUCCESS, "", szMsg);
    UART_PutString(szMsg);
    return ERRVAL_SUCCESS;
}

