Digilent/DMMShield_PIC32_Library/DMMLib.X/dmmcmd.c
/***	DMMCMD_CmdMeasureRaw
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS            0      // success
**
**	Description:
**		This function initiates the DMMMeasureRaw repeated command session of DMMCMD module. 
**      The function always returns success: ERRVAL_SUCCESS.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdMeasureRaw()
{
	fRepGetVal = 0;
	fRepGetRaw = 1;
    strcpy(szMsg, "Measure raw");
    ERRORS_GetPrefixedMessageString(ERRVAL_SUCCESS, "", szMsg);
    UART_PutString(szMsg);
    return ERRVAL_SUCCESS;
}

/***	DMMCMD_CmdMeasureAvg
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS              0       // success
**          ERRVAL_DMM_VALIDDATATIMEOUT 0xFA    // valid data DMM timeout
**          ERRVAL_DMM_IDXCONFIG        0xFC    // error, wrong current scale index
**
**	Description:
**		This function implements the DMMMeasureAVG text command of DMMCMD module.
**		The function calls the DMM_DGetAvgValue.
**		In case of success, the returned value is formatted and sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The function returns the error code, which is the error code raised by the DMM_DGetAvgValue function.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdMeasureAvg()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	char szVal[200];
//	char szVal[20];
	double dMeasuredVal;
    dMeasuredVal = DMM_DGetAvgValue(MEASURE_CNT_AVG, &bErrCode);
    fRepGetVal = 0;
    fRepGetRaw = 0;
    if(bErrCode == ERRVAL_SUCCESS)
    {
        DMM_FormatValue(dMeasuredVal, szVal, 1);
        sprintf(szMsg, "Avg. Value: %s\r\n", szVal);
    }
    else
    {
        // like this, prefixing is skipped for ERRVAL_SUCCESS
        ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
    }
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdCalibP
**
**	Parameters:
**     char const *arg0           - the character string containing the first command argument, to be interpreted as reference value
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**          ERRVAL_CMD_VALWRONGUNIT         0xF4    // The provided value has a wrong measure unit.
**          ERRVAL_CMD_VALFORMAT            0xF2    // The numeric value cannot be extracted from the provided string.
**          ERRVAL_DMM_VALIDDATATIMEOUT     0xFA    // valid data DMM timeout
**          ERRVAL_DMM_MEASUREDISPERSION    0xF1    // The calibration measurement dispersion exceeds accepted range
**          ERRVAL_CALIB_MISSINGMEASUREMENT 0xF0    // A measurement must be performed before calling the finalize calibration function.
**
**	Description:
**		This function implements the DMMCalibP text command of DMMCMD module.
**      It interprets the argument as reference value by calling DMM_InterpretValue function. 
**      then it calls CALIB_CalibOnPositive providing the reference value as parameter and collecting the measured value and dispersion.
**		In case of success, the function builds the message using the formatted strings for reference value, measured value and dispersion and eventually 
**      the calibration coefficients. Then the message is sent over UART.
 **		In case of error, the error specific message is sent over UART.
**      The return values are possible errors of DMM_InterpretValue and DMMCalibP functions.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdCalibP(char const *arg0)
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    bErrCode = DMM_InterpretValue((char *)arg0, &dRefVal);
    if(bErrCode == ERRVAL_SUCCESS)
    {
		bErrCode = CALIB_CalibOnPositive(dRefVal, &dMeasuredVal, 0, &dispersion, 0);
        if(bErrCode == ERRVAL_SUCCESS)
        {
            DMM_FormatValue(dRefVal, szRefVal, 1);
            DMM_FormatValue(dMeasuredVal, szVal, 1);            
    		sprintf(szMsg, "Calibration on positive done. Reference: %s, Measured: %s, Dispersion: %.2f%%", szRefVal, szVal, dispersion);
    		if(pszLastErr[0])
    		{
    			// append last error string to the message (used for calibration coefficients)
    			strcat(szMsg, ", ");
    			strcat(szMsg, pszLastErr);
    		}
        }
        ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);

    }
    else
    {
    	ERRORS_GetPrefixedMessageString(bErrCode, (char *)arg0, szMsg);
    }
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdCalibN
**
**	Parameters:
**     char const *arg0           - the character string containing the first command argument, to be interpreted as reference value
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**          ERRVAL_CMD_VALWRONGUNIT         0xF4    // The provided value has a wrong measure unit.
**          ERRVAL_CMD_VALFORMAT            0xF2    // The numeric value cannot be extracted from the provided string.
**          ERRVAL_DMM_VALIDDATATIMEOUT     0xFA    // valid data DMM timeout
**          ERRVAL_DMM_MEASUREDISPERSION    0xF1    // The calibration measurement dispersion exceeds accepted range
**          ERRVAL_CALIB_MISSINGMEASUREMENT 0xF0    // A measurement must be performed before calling the finalize calibration function.
**
**	Description:
**		This function implements the DMMCalibN text command of DMMCMD module.
**      It interprets the argument as reference value by calling DMM_InterpretValue function. 
**      then it calls CALIB_CalibOnNegative providing the reference value as parameter and collecting the measured value and dispersion.
**		In case of success, the function builds the message using the formatted strings for reference value, measured value and dispersion. Then the message is sent over UART.
**      the calibration coefficients. Then the message is sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The return values are possible errors of DMM_InterpretValue and DMMCalibN functions.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdCalibN(char const *arg0)
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    bErrCode = DMM_InterpretValue((char *)arg0, &dRefVal);
    if(bErrCode == ERRVAL_SUCCESS)
    {
        DMM_FormatValue(dRefVal, szRefVal, 1);
		bErrCode = CALIB_CalibOnNegative(dRefVal, &dMeasuredVal, 0, &dispersion, 0);
        if(bErrCode == ERRVAL_SUCCESS)
        {
            DMM_FormatValue(dMeasuredVal, szVal, 1);            
    		sprintf(szMsg, "Calibration on negative done. Reference: %s, Measured: %s, Dispersion: %.2f%%", szRefVal, szVal, dispersion);
    		if(pszLastErr[0])
    		{
    			// append last error string to the message (used for calibration coefficients)
    			strcat(szMsg, ", ");
    			strcat(szMsg, pszLastErr);
    		}
        }
        ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);

