Digilent/DMMShield_PIC32_Library/DMMLib.X/dmmcmd.c
    }
    else
    {
    	ERRORS_GetPrefixedMessageString(bErrCode, (char *)arg0, szMsg);
    }
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdCalibZ
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**          ERRVAL_CMD_VALWRONGUNIT         0xF4    // The provided value has a wrong measure unit.
**          ERRVAL_CMD_VALFORMAT            0xF2    // The numeric value cannot be extracted from the provided string.
**          ERRVAL_DMM_VALIDDATATIMEOUT     0xFA    // valid data DMM timeout
**          ERRVAL_DMM_MEASUREDISPERSION    0xF1    // The calibration measurement dispersion exceeds accepted range
**          ERRVAL_CALIB_MISSINGMEASUREMENT 0xF0    // A measurement must be performed before calling the finalize calibration function.**
**	Description:
**		This function implements the DMMCalibZ text command of DMMCMD module.
**      It calls CALIB_CalibOnZero collecting the measured value and dispersion.
**		In case of success, the function builds the message using the formatted string for measured value, dispersion and eventually 
**      the calibration coefficients. Then the message is sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The return values are possible errors of DMMCalibZ functions.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdCalibZ()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	bErrCode = CALIB_CalibOnZero(&dMeasuredVal, &dispersion, 0);
    if(bErrCode == ERRVAL_SUCCESS)
    {
         DMM_FormatValue(dMeasuredVal, szVal, 1);
         sprintf(szMsg, "Calibration on zero done. Measured Value: %s, Dispersion: %.2f%%", szVal, dispersion);
         if(pszLastErr[0])
         {
             // append last error string to the message (used for calibration coefficients)
             strcat(szMsg, ", ");
             strcat(szMsg, pszLastErr);
         }
	}
	ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);

    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdSaveEPROM
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_EPROM_WRTIMEOUT          0xFF    // EPROM write data ready timeout
**
**	Description:
**		This function implements the DMMSaveEPROM text command of DMMCMD module.
**      It calls CALIB_WriteAllCalibsToEPROM_User collecting the number of modified scales or error code.
**		In case of success, the function builds the message using the the number of modified scales. Then the message is sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The function returns the error code, which is the error code returned by the CALIB_WriteAllCalibsToEPROM_User function.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdSaveEPROM()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    bErrCode = CALIB_WriteAllCalibsToEPROM_User();
    if (bErrCode != ERRVAL_EPROM_WRTIMEOUT)
    {
        sprintf(szMsg, "%d calibrations written to EPROM", bErrCode);
        bErrCode = ERRVAL_SUCCESS;
    }
    ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);

    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdVerifyEPROM
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_GENERICERROR         0xEF    // Generic error
**          ERRVAL_EPROM_MAGICNO            0xFD    // wrong Magic No. when reading data from EPROM
**          ERRVAL_EPROM_CRC                0xFE    // wrong CRC when reading data from EPROM
**
**	Description:
**		This function implements the DMMVerifyEPROM text command of DMMCMD module.
**      It calls CALIB_VerifyEPROM collecting the error code.
**		In case of success and verify error, the function builds separate messages and then the messages are sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The function returns the error code, which is the error code returned by the CALIB_VerifyEPROM function, with the exception 
**      that ERRVAL_DMM_GENERICERROR is returned in the case of verify error.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdVerifyEPROM()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    bErrCode = CALIB_VerifyEPROM();
    switch(bErrCode)
    {
        case ERRVAL_SUCCESS:
            strcpy(szMsg, "EPROM Calibration data is verified");
            break;
        case ERRVAL_EPROM_VERIFY:
            strcpy(szMsg, "EPROM Calibration data mismatch values found");
            bErrCode = ERRVAL_DMM_GENERICERROR;
            break;
        default:
            break;
    }
    ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);

    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdExportCalib
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_EPROM_MAGICNO            0xFD    // wrong Magic No. when reading data from EPROM
**          ERRVAL_EPROM_CRC                0xFE    // wrong CRC when reading data from EPROM
**
**	Description:
**		This function implements the DMMExportCalib text command of DMMCMD module.
**      It calls CALIB_ExportCalibs_User collecting the exported string.
**		In case of success, the function sends the success message and the exported text over UART.
**		In case of error, the error specific message is sent over UART.
**      The function returns the error code, which is the error code returned by the CALIB_ExportCalibs_User function.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdExportCalib()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    char calExp[1024];
    bErrCode = CALIB_ExportCalibs_User(calExp);
    strcpy(szMsg, "Calibration data is exported");
    ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
    UART_PutString(szMsg);
    UART_PutString(calExp);
    return bErrCode;
}

/***	DMMCMD_CmdImportCalib
**
**	Parameters:
**     char const *arg0           - the character string containing the first command argument, to be interpreted as scale index (integer)
**     char const *arg1           - the character string containing the second command argument, to be interpreted as Mult. coefficient (float)
**     char const *arg2           - the character string containing the third command argument, to be interpreted as Add. coefficient (float)
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_CMD_WRONGPARAMS          0xF9    // wrong parameters when sending UART commands
**          ERRVAL_DMM_GENERICERROR         0xEF    // Generic error, parameters cannot be properly interpreted
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**
**	Description:
**		This function implements the DMMImportCalib text command of DMMCMD module.
**      It interprets the first parameter as scale index, the second as Mult. coefficient, and the third as Add. coefficient.
**      In case these parameters do not fit, specific error messages are sent over UART and ERRVAL_CMD_WRONGPARAMS or ERRVAL_DMM_GENERICERROR errors are returned.
**      It calls CALIB_ImportCalibCoefficients providing the scale index, Mult. coefficient and Add. coefficient.
**		In case of success, the function sends the success message over UART.
**		In case of error, the error specific message is sent over UART.
**      The function returns the error code, which is the error code detected when parameters are interpreted or returned by the CALIB_ImportCalibCoefficients function.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdImportCalib(char const *arg0, char const *arg1, char const *arg2)
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	int idxCfg;
    float fValM, fValA;
    if(!arg0 || !arg1 || !arg2)
    {
    	bErrCode = ERRVAL_CMD_WRONGPARAMS;
    }
    if(bErrCode == ERRVAL_SUCCESS)
    {
		// idxScale
		if (!sscanf(arg0, "%d", &idxCfg))
		{
			strcpy(szMsg, "Invalid value, provide an integer number for the first token, corresponding to scale index");
			bErrCode = ERRVAL_DMM_GENERICERROR;
		}
		else
		{	// Mult coefficient
			if (!sscanf(arg1, "%f", &fValM))
			{
				strcpy(szMsg, "Invalid value, provide a float number for the second token, corresponding to Mult. coefficient");
				bErrCode = ERRVAL_DMM_GENERICERROR;
			}
			else
			{	// Add coefficient
				if (!sscanf(arg2, "%f", &fValA))
				{
					strcpy(szMsg, "Invalid value, provide a float number for the third token, corresponding to Add. coefficient");
					bErrCode = ERRVAL_DMM_GENERICERROR;
				}
			}
		}
    }
    if(bErrCode == ERRVAL_SUCCESS)
    {
        bErrCode = CALIB_ImportCalibCoefficients(idxCfg, fValM, fValA);
    }
    ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdMeasureForCalibP
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**          ERRVAL_DMM_VALIDDATATIMEOUT     0xFA    // valid data DMM timeout
**
**	Description:
**		This function implements the DMMMeasureForCalibP text command of DMMCMD module.
**      It calls CALIB_MeasureForCalibPositiveVal collecting the measured value.
**		In case of success, the function builds the message using the formatted string for measured value. Then the message is sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The return values are possible errors of CALIB_MeasureForCalibPositiveVal functions.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdMeasureForCalibP()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	double dMeasuredVal;
	bErrCode = CALIB_MeasureForCalibPositiveVal(&dMeasuredVal);

	if(bErrCode == ERRVAL_SUCCESS)
	{
		DMM_FormatValue(dMeasuredVal, szVal, 1);
		sprintf(szMsg, "Calibration positive measurement done. Measured Value: %s", szVal);
	}
	ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdMeasureForCalibN
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**          ERRVAL_DMM_VALIDDATATIMEOUT     0xFA    // valid data DMM timeout
**
**	Description:
**		This function implements the DMMMeasureForCalibN text command of DMMCMD module.
**      It calls CALIB_MeasureForCalibNegativeVal collecting the measured value.
**		In case of success, the function builds the message using the formatted string for measured value. Then the message is sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The return values are possible errors of CALIB_MeasureForCalibNegativeVal functions.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdMeasureForCalibN()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	double dMeasuredVal;
	bErrCode = CALIB_MeasureForCalibNegativeVal(&dMeasuredVal);

	if(bErrCode == ERRVAL_SUCCESS)
	{
		DMM_FormatValue(dMeasuredVal, szVal, 1);
		sprintf(szMsg, "Calibration negative measurement done. Measured Value: %s", szVal);
	}
	ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
    UART_PutString(szMsg);
    return bErrCode;
}


/***	DMMCMD_CmdFinalizeCalibP
**
**	Parameters:
**     char const *arg0           - the character string containing the first command argument, to be interpreted as reference value
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**          ERRVAL_CMD_VALWRONGUNIT         0xF4    // The provided value has a wrong measure unit.
**          ERRVAL_CMD_VALFORMAT            0xF2    // The numeric value cannot be extracted from the provided string.
**          ERRVAL_DMM_MEASUREDISPERSION    0xF1    // The calibration measurement dispersion exceeds accepted range
**          ERRVAL_CALIB_MISSINGMEASUREMENT 0xF0    // A measurement must be performed before calling the finalize calibration function.
**
**	Description:
**		This function implements the DMMFinalizeCalibP text command of DMMCMD module.
**      It interprets the argument as reference value by calling DMM_InterpretValue function.
**      then it calls CALIB_CalibOnPositive providing the reference value as parameter and collecting the measured value and dispersion.
**		In case of success, the function builds the message using the formatted strings for reference value, measured value and dispersion and eventually
**      the calibration coefficients. Then the message is sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The return values are possible errors of DMM_InterpretValue and DMMCalibP functions.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdFinalizeCalibP(char const *arg0)
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	bErrCode = DMM_InterpretValue((char *)arg0, &dRefVal);
	if(bErrCode == ERRVAL_SUCCESS)
	{
		DMM_FormatValue(dRefVal, szRefVal, 1);
		bErrCode = CALIB_CalibOnPositive(dRefVal, &dMeasuredVal, 1, &dispersion, 0);
		if(bErrCode == ERRVAL_SUCCESS)
		{
			DMM_FormatValue(dMeasuredVal, szVal, 1);
			sprintf(szMsg, "Calibration on positive done. Reference: %s, Measured: %s, Dispersion: %.2f%%", szRefVal, szVal, dispersion);
			if(pszLastErr[0])
			{
				// append last error string to the message (used for calibration coefficients)
				strcat(szMsg, ", ");
				strcat(szMsg, pszLastErr);
			}
		}
		ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
	}
    else
    {
    	ERRORS_GetPrefixedMessageString(bErrCode, (char *)arg0, szMsg);
    }
	UART_PutString(szMsg);
	return bErrCode;
}

/***	DMMCMD_CmdFinalizeCalibN
**
**	Parameters:
**     char const *arg0           - the character string containing the first command argument, to be interpreted as reference value
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_DMM_IDXCONFIG            0xFC    // wrong scale index
**          ERRVAL_CMD_VALWRONGUNIT         0xF4    // The provided value has a wrong measure unit.
**          ERRVAL_CMD_VALFORMAT            0xF2    // The numeric value cannot be extracted from the provided string.
**          ERRVAL_DMM_MEASUREDISPERSION    0xF1    // The calibration measurement dispersion exceeds accepted range
**          ERRVAL_CALIB_MISSINGMEASUREMENT 0xF0    // A measurement must be performed before calling the finalize calibration function.
**
**	Description:
**		This function implements the DMMCalibN text command of DMMCMD module.
**      It interprets the argument as reference value by calling DMM_InterpretValue function.
**      then it calls CALIB_CalibOnNegative providing the reference value as parameter and collecting the measured value and dispersion.
**		In case of success, the function builds the message using the formatted strings for reference value, measured value and dispersion and eventually
**      the calibration coefficients. Then the message is sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The return values are possible errors of DMM_InterpretValue and DMMCalibN functions.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdFinalizeCalibN(char const *arg0)
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
	bErrCode = DMM_InterpretValue((char *)arg0, &dRefVal);
	if(bErrCode == ERRVAL_SUCCESS)
	{
		DMM_FormatValue(dRefVal, szRefVal, 1);
        bErrCode = CALIB_CalibOnNegative(dRefVal, &dMeasuredVal, 1, &dispersion, 0);
        if(bErrCode == ERRVAL_SUCCESS)
        {
            DMM_FormatValue(dMeasuredVal, szVal, 1);
            sprintf(szMsg, "Calibration on negative done. Reference: %s, Measured: %s, Dispersion: %.2f%%", szRefVal, szVal, dispersion);
            if(pszLastErr[0])
            {
                // append last error string to the message (used for calibration coefficients)
                strcat(szMsg, ", ");
                strcat(szMsg, pszLastErr);
            }
        }
        ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
	}
    else
    {
    	ERRORS_GetPrefixedMessageString(bErrCode, (char *)arg0, szMsg);
    }
	UART_PutString(szMsg);
	return bErrCode;
}

/***	DMMCMD_CmdRestoreFactCalib
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS                  0       // success
**          ERRVAL_EPROM_MAGICNO            0xFD    // wrong Magic No. when reading data from EPROM
**          ERRVAL_EPROM_CRC                0xFE    // wrong CRC when reading data from EPROM
**          ERRVAL_EPROM_WRTIMEOUT          0xFF    // EPROM write data ready timeout
**
**	Description:
**		This function implements the DMMDRestoreFactCalib text command of DMMCMD module.
**      It calls CALIB_RestoreAllCalibsFromEPROM_Factory.
**		In case of success, the function sends the success message and the exported text over UART.
**		In case of error, the error specific message is sent over UART.
**      The function returns the error code, which is the error code returned by the CALIB_RestoreAllCalibsFromEPROM_Factory function.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdRestoreFactCalib()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    bErrCode = CALIB_RestoreAllCalibsFromEPROM_Factory();
    strcpy(szMsg, "Calibration data restored from FACTORY EPROM");
    ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_CmdReadSerialNo
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS              0       // success
**          ERRVAL_EPROM_CRC            0xFE    // wrong CRC when reading data from EPROM
**          ERRVAL_EPROM_MAGICNO        0xFD    // wrong Magic No. when reading data from EPROM
**
**	Description:
**		This function implements the DMMReadSerialNo text command of DMMCMD module.
**      It calls SERIALNO_ReadSerialNoFromEPROM and collects the serial number string.
**		In case of success, the function sends the success message containing the serial number over UART.
**		In case of error, the error specific message is sent over UART.
**      The function returns the error code, which is the error code returned by the SERIALNO_ReadSerialNoFromEPROM function.
**      The function is called by DMMCMD_ProcessCmd function.
**
*/
uint8_t DMMCMD_CmdReadSerialNo()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    char szSerialNo[SERIALNO_SIZE + 1];
    bErrCode = SERIALNO_ReadSerialNoFromEPROM(szSerialNo);
    if (bErrCode == ERRVAL_SUCCESS)
    {
        sprintf(szMsg, "SerialNo = \"%s\"", szSerialNo);
    }
    ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
    UART_PutString(szMsg);
    return bErrCode;
}

/***	DMMCMD_ProcessRepeatedCmd
**
**	Parameters:
**     none
**
**	Return Value:
**		uint8_t     - the error code
**          ERRVAL_SUCCESS              0       // success
**          ERRVAL_DMM_VALIDDATATIMEOUT 0xFA    // valid data DMM timeout
**          ERRVAL_DMM_IDXCONFIG        0xFC    // error, wrong current scale index
**
**	Description:
**		This function implements the repeated session functionality for DMMMeasureRep and DMMMeasureRaw text commands of DMMCMD module.
**		The function calls the DMM_DGetValue, eventually without calibration parameters being applied for DMMMeasureRaw.
**		In case of success, the returned value is formatted and sent over UART.
**		In case of error, the error specific message is sent over UART.
**      The function is called by DMMCMD_ProcessCmd function.
*/
uint8_t DMMCMD_ProcessRepeatedCmd()
{
	uint8_t bErrCode = ERRVAL_SUCCESS;
    if(fRepGetVal || fRepGetRaw)
    {
        if(fRepGetRaw)
        {
        	DMM_SetUseCalib(0);
        }
        dMeasuredVal = DMM_DGetValue(&bErrCode);
        DMM_SetUseCalib(1);
        if(bErrCode == ERRVAL_SUCCESS)
        {
            if(fRepGetVal)
            {
                DMM_FormatValue(dMeasuredVal, szVal, 1);
                sprintf(szMsg, "Value: %s\r\n", szVal);
            }
            else
            {
                sprintf(szMsg, "Raw Value: %.6lf\r\n", dMeasuredVal);
            }
        }
        else
        {
            bErrCode = ERRORS_GetPrefixedMessageString(bErrCode, "", szMsg);
        }
        UART_PutString(szMsg);
    }
    return bErrCode;    
}

void EnableCaches()
{
#ifdef __MICROBLAZE__
#ifdef XPAR_MICROBLAZE_USE_ICACHE
    Xil_ICacheEnable();
#endif
#ifdef XPAR_MICROBLAZE_USE_DCACHE
    Xil_DCacheEnable();
#endif
#endif
}

void DisableCaches()
{
#ifdef __MICROBLAZE__
#ifdef XPAR_MICROBLAZE_USE_DCACHE
    Xil_DCacheDisable();
#endif
#ifdef XPAR_MICROBLAZE_USE_ICACHE
    Xil_ICacheDisable();
#endif
#endif
}
/* *****************************************************************************
 End of File
 */
